## Importing one File & Understanding the Data Structure

In [2]:
import pandas as pd

In [5]:
pd.read_csv('yob1880.txt')

           Mary  F  7065
0          Anna  F  2604
1          Emma  F  2003
2     Elizabeth  F  1939
3        Minnie  F  1746
4      Margaret  F  1578
...         ... ..   ...
1994     Woodie  M     5
1995     Worthy  M     5
1996     Wright  M     5
1997       York  M     5
1998  Zachariah  M     5

[1999 rows x 3 columns]

In [6]:
df = pd.read_csv('yob1880.txt', header=None, names=['Name','Gender','Count'])

In [7]:
df

           Name Gender  Count
0          Mary      F   7065
1          Anna      F   2604
2          Emma      F   2003
3     Elizabeth      F   1939
4        Minnie      F   1746
...         ...    ...    ...
1995     Woodie      M      5
1996     Worthy      M      5
1997     Wright      M      5
1998       York      M      5
1999  Zachariah      M      5

[2000 rows x 3 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2000 non-null   object
 1   Gender  2000 non-null   object
 2   Count   2000 non-null   int64
dtypes: int64(1), object(2)
memory usage: 47.0+ KB

## Importing & merging many files (easy case)

__Load__ all files (yob????.txt) and __merge/concatenate__ all files into one Pandas DataFrame. Make sure you add the __column "Year"__.

In [20]:
import os

files = os.listdir()
txt_files = list(filter(lambda filename: '.txt' in filename, files))

df = pd.DataFrame()
for file in txt_files:
    df_new = pd.read_csv(file, header=None, names=['Name','Gender','Count'])
    df_new['Year'] = int(file.split(".")[0].split('yob')[1])
    df = pd.concat([df, df_new], ignore_index=True)

In [22]:
df

              Name Gender  Count  Year
0             Mary      F   8148  1882
1             Anna      F   3143  1882
2             Emma      F   2303  1882
3        Elizabeth      F   2186  1882
4           Minnie      F   2004  1882
...            ...    ...    ...   ...
1957041       Zach      M      5  1933
1957042        Zan      M      5  1933
1957043     Zannie      M      5  1933
1957044     Zebbie      M      5  1933
1957045       Zeke      M      5  1933

[1957046 rows x 4 columns]

Create a __RangeIndex__ and __save__ the DataFrame (with columns "Year", "Name", "Gender" and "Count") in a new csv-file.

In [25]:
df.index

RangeIndex(start=0, stop=1957046, step=1)

In [24]:
df.reset_index().index

RangeIndex(start=0, stop=1957046, step=1)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1957046 entries, 0 to 1957045
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   Name    object
 1   Gender  object
 2   Count   int64
 3   Year    int64
dtypes: int64(2), object(2)
memory usage: 59.7+ MB

In [ ]:
# df.to_csv("us_baby_names.csv", index = False)

In [ ]:
# pd.read_csv("us_baby_names.csv")